In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('Bengaluru_House_Data.csv')

In [3]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
for col in df.columns:
    print(df[col].value_counts())
    print("*****************")

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
*****************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: availability, Length: 81, dtype: int64
*****************
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64
*****************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64
*****************
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: society, Length: 2688, dtype: int64
*****************
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: total_sqft, Length: 2117, dtype: int64
*****************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: bath, dtype: int64
*****************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
*****************
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: price, Length: 1994, dtype: int64
*****************

In [5]:
#only 15 house has NaN in size--> replacing with most frequent
df['size']=df['size'].fillna('2 BHK')

In [6]:
df.rename(columns={'size':'BHK'},inplace=True)
#help(df.rename)

In [7]:
df.head()

,area_type,availability,location,BHK,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [8]:
#for analysis we need numerical data only
df['BHK']=df['BHK'].str.split().str.get(0).astype(int)

In [9]:
def only_num(x):
    res=''
    for i in x:
        if i.isdigit() or i==' ':
            res=res+i
    try:
        return float(res)
    except:
        res=res.split()
        return float(res[0])/2+float(res[1])/2

In [10]:
df.total_sqft=df.total_sqft.apply(only_num)

In [11]:
df.head()

,area_type,availability,location,BHK,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2,Coomee,1056.0,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4,Theanmp,2600.0,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3,NaN,1440.0,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3,Soiewre,1521.0,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2,NaN,1200.0,2.0,1.0,51.00

In [12]:
df.location.value_counts()

Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64

In [13]:
df.location.fillna('Whitefield',inplace=True)

In [14]:
df.location=df.location.apply(lambda loc:loc.strip())

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13320 non-null  object
 3   BHK           13320 non-null  int32
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  float64
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(4), int32(1), object(4)
memory usage: 884.7+ KB

In [16]:
loc_count=df.location.value_counts()

In [17]:
loc_count_10=loc_count[loc_count<=10]

In [18]:
df.location=df.location.apply(lambda loc:'other' if loc in loc_count_10 else loc)

In [19]:
df.location.value_counts()

other                 2885
Whitefield             542
Sarjapur  Road         399
Electronic City        304
Kanakpura Road         273
                      ...
Nehru Nagar             11
Banjara Layout          11
LB Shastri Nagar        11
Pattandur Agrahara      11
Narayanapura            11
Name: location, Length: 242, dtype: int64

In [20]:
df['price_sqft']=df.price*100000/df.total_sqft

In [21]:
(df.total_sqft/df.BHK).describe()

count     13320.000000
mean        888.700045
std        4408.021253
min           0.250000
25%         473.333333
50%         553.333333
75%         627.500000
max      113316.800000
dtype: float64

In [22]:
df=df[(df.total_sqft/df.BHK)>=300]

In [23]:
(df.total_sqft/df.BHK).describe()

count     12551.000000
mean        931.626905
std        4537.521708
min         300.000000
25%         492.500000
50%         563.666667
75%         633.333333
max      113316.800000
dtype: float64

In [24]:
df['price_sqft'].describe()

count     12551.000000
mean       6245.141025
std        4181.269925
min          34.753539
25%        4187.716982
50%        5266.106443
75%        6875.000000
max      176470.588235
Name: price_sqft, dtype: float64

In [25]:
def remove_sqft_ol(df):
    df_out=pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m=np.mean(subdf.price_sqft)
        
        st=np.std(subdf.price_sqft)
        
        
        gen_df=subdf[(subdf.price_sqft>(m-st))&(subdf.price_sqft<=(m+st))]
        df_out=pd.concat([df_out,gen_df],ignore_index=True)
    return df_out
df=remove_sqft_ol(df)

In [26]:
df.describe()

,BHK,total_sqft,bath,balcony,price,price_sqft
count,10342.000000,10342.000000,10288.000000,9970.000000,10342.000000,10342.000000
mean,2.571940,1515.017211,2.471229,1.591073,90.892658,5636.799841
std,0.899127,984.586118,0.981677,0.796711,86.247857,2259.585342
min,1.000000,300.000000,1.000000,0.000000,10.000000,989.642088
25%,2.000000,1105.250000,2.000000,1.000000,48.762500,4227.315448
50%,2.000000,1282.000000,2.000000,2.000000,67.000000,5154.639175
75%,3.000000,1650.000000,3.000000,2.000000,100.000000,6403.290322
max,16.000000,33018.000000,16.000000,3.000000,2200.000000,24509.803922

In [27]:
def bhk_ol(df):
    exclude_indices=np.array([])
    for location,location_df in df.groupby('location'):
        BHK_stats={}
        for BHK,BHK_df in location_df.groupby('BHK'):
            BHK_stats[BHK]={
                'mean':np.mean(BHK_df.price_sqft),
                'std':np.std(BHK_df.price_sqft),
                'count':BHK_df.shape[0]
            }
        for BHK,BHK_df in location_df.groupby('BHK'):
            stats=BHK_stats.get(BHK-1)
            if stats and stats['count']>5:
                exclude_indices=np.append(exclude_indices,BHK_df[BHK_df.price_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')

In [28]:
df=bhk_ol(df)

In [29]:
df.shape

(7391, 10)

In [30]:
df.head()

,area_type,availability,location,BHK,society,total_sqft,bath,balcony,price,price_sqft
0,Super built-up Area,20-May,1st Block Jayanagar,4,NaN,2850.0,4.0,1.0,428.0,15017.543860
1,Super built-up Area,18-Jun,1st Block Jayanagar,3,NaN,1630.0,3.0,2.0,194.0,11901.840491
2,Super built-up Area,Ready To Move,1st Block Jayanagar,3,NaN,1875.0,2.0,3.0,235.0,12533.333333
3,Built-up Area,15-Dec,1st Block Jayanagar,3,Bhsic C,1200.0,2.0,0.0,130.0,10833.333333
4,Super built-up Area,18-Jun,1st Block Jayanagar,2,NaN,1235.0,2.0,2.0,148.0,11983.805668

In [31]:
df.drop(columns=['area_type','society','price_sqft'],inplace=True)

In [32]:
df.drop('availability',axis=1,inplace=True)

In [33]:
df

                  location  BHK  total_sqft  bath  balcony  price
0      1st Block Jayanagar    4      2850.0   4.0      1.0  428.0
1      1st Block Jayanagar    3      1630.0   3.0      2.0  194.0
2      1st Block Jayanagar    3      1875.0   2.0      3.0  235.0
3      1st Block Jayanagar    3      1200.0   2.0      0.0  130.0
4      1st Block Jayanagar    2      1235.0   2.0      2.0  148.0
...                    ...  ...         ...   ...      ...    ...
10333                other    2      1200.0   2.0      3.0   70.0
10334                other    1      1800.0   1.0      1.0  200.0
10337                other    2      1353.0   2.0      2.0  110.0
10338                other    1       812.0   1.0      0.0   26.0
10341                other    4      3600.0   5.0      NaN  400.0

[7391 rows x 6 columns]

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7391 entries, 0 to 10341
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    7391 non-null   object
 1   BHK         7391 non-null   int32
 2   total_sqft  7391 non-null   float64
 3   bath        7358 non-null   float64
 4   balcony     7135 non-null   float64
 5   price       7391 non-null   float64
dtypes: float64(4), int32(1), object(1)
memory usage: 375.3+ KB

In [35]:
df.balcony=df.balcony.ffill()

In [36]:
df.bath=df.bath.fillna(df.bath.median())

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7391 entries, 0 to 10341
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    7391 non-null   object
 1   BHK         7391 non-null   int32
 2   total_sqft  7391 non-null   float64
 3   bath        7391 non-null   float64
 4   balcony     7391 non-null   float64
 5   price       7391 non-null   float64
dtypes: float64(4), int32(1), object(1)
memory usage: 375.3+ KB

In [38]:
df.to_csv('clean__BHD.csv')

In [39]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.pipeline import make_pipeline
from sklearn.preprocessing import StandardScaler,OneHotEncoder
from sklearn.compose import make_column_transformer

In [40]:
column_trans=make_column_transformer((OneHotEncoder(sparse=False),['location']),remainder='passthrough')

In [41]:
X=df.drop('price',axis=1)
y=df.price

In [42]:
train_X,val_X,train_y,val_y=train_test_split(X,y,random_state=0)

In [43]:
scaler=StandardScaler()

In [44]:
lr=LinearRegression(normalize=True)
pipe=make_pipeline(column_trans,scaler,lr)
pipe.fit(train_X,train_y)
pred_y_lr=pipe.predict(val_X)
r2_score(val_y,pred_y_lr)

0.8246818917288666

In [45]:
ridge=Ridge()
pipe=make_pipeline(column_trans,scaler,ridge)
pipe.fit(train_X,train_y)
pred_y_rd=pipe.predict(val_X)
r2_score(val_y,pred_y_rd)

0.8245431037215962

In [46]:
lasso=Lasso()
pipe=make_pipeline(column_trans,scaler,lasso)
pipe.fit(train_X,train_y)
pred_y_ls=pipe.predict(val_X)
r2_score(val_y,pred_y_ls)

0.8156201547749488

In [47]:
from sklearn.metrics import mean_absolute_error
from sklearn.ensemble import RandomForestRegressor
modl=RandomForestRegressor(random_state=1,n_estimators=10)
Rmodel=make_pipeline(column_trans,scaler,modl)
Rmodel.fit(train_X,train_y)

Rerror=mean_absolute_error(val_y,Rmodel.predict(val_X))
Rerror

16.54093307787802